---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoomBoundingElementsWarn
source: html/19f07e65-8eb4-1cbb-7303-13bcc86b2947.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoomBoundingElementsWarn Property

Can't create any energy analysis surfaces. There are no Room bounding elements defined in the current phase. Please check the Project Information settings.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRoomBoundingElementsWarn { get; }
```